<template>
  <div class="example-content">
    <div class="page-conteiner__text">
      Таким образом консультация с широким активом представляет собой интересный
      эксперимент проверки позиций, занимаемых участниками в отношении
      поставленных задач. С другой стороны постоянное
      информационно-пропагандистское обеспечение нашей деятельности представляет
      собой интересный эксперимент проверки форм развития. Идейные соображения
      высшего порядка, а также укрепление и развитие структуры влечет за собой
      процесс внедрения и модернизации соответствующий условий активизации.
      Задача организации, в особенности же реализация намеченных плановых
      заданий играет важную роль в формировании дальнейших направлений развития.
      Повседневная практика показывает, что постоянное
      информационно-пропагандистское обеспечение нашей деятельности играет
      важную роль в формировании существенных финансовых и административных
      условий.
    </div>
    <div class="page-conteiner__title">Смотрите какие обезьянки</div>
    <img class="page-conteiner__image" src="@/images/monkeys.png" alt="" />
    <div class="page-conteiner__text">
      Таким образом консультация с широким активом представляет собой интересный
      эксперимент проверки позиций, занимаемых участниками в отношении
      поставленных задач. С другой стороны постоянное
      информационно-пропагандистское обеспечение нашей деятельности представляет
      собой инйцу шо шщйоц ущойц ущошцщйуо йцщуо йщцоу щйоу шщйцош ущйтересный
      эксперимент проверки форм развития. Идейные соображения высшего порядка, а
      также укрепление и развитие структуры влечет за собой процесс внедрения и
      модернизации соответствующий условий активизации. Задача организации, в
      особенности же реализация намеченных плановых заданий играет важную роль в
      формировании дальнейших направлений развития. Повседневная практика
      показывает, что постоянное информационно-пропагандистское обеспечение
      нашей деятельности играет важную роль в формировании существенных
      финансовых и административных условий.
    </div>
    <div class="page-conteiner__text">
      Товарищи! новая модель организационной деятельности требуют от нас анализа
      направлений прогрессивного развития. Задача организации, в особенности же
      постоянный количественный рост и сфера нашей активности требуют от нас
      анализа позиций, занимаемых участниками в отношении поставленных задач.
      Задача организации, в особенности же реализация намеченных плановых
      заданий требуют от нас анализа системы обучения кадров, соответствует
      насущным потребностям. <br />
    </div>
  </div>
</template>

<script>
export default {
  // props: {
  //   editContent: {
  //     type: String,
  //     required: true,
  //   },
  // },
  data() {
    return {
      content: "",
    };
  },
  mounted() {
    // this.content = this.editContent;
  },
};
</script>
<style>
.page-conteiner__text {
  font-family: "Roboto", sans-serif;
  font-size: 15px;
  color: #eaeaea;
  line-height: 23px;
  max-width: 621px;
  -webkit-margin-collapse: collapse;
}
.page-conteiner__inserted-text {
  margin: 31px 0px;
}
.page-conteiner__title {
  color: #fff;
  font-family: "Roboto", sans-serif;
  font-size: 31px;
  font-style: normal;
  font-weight: 400;
  line-height: 23px;
  margin: 0;
  -webkit-margin-collapse: collapse;
  margin-top: 46px;
}
.page-conteiner__inserted-title {
  margin: 46px 0px 31px 0px;
}
.page-conteiner__text + .page-conteiner__title {
  margin-top: 46px;
}

.page-conteiner__text + .page-conteiner__text {
  margin-top: 31px;
}
.page-conteiner__image + .page-conteiner__text {
  margin-top: 31px;
}
.page-conteiner__image {
  margin: 33px 0px 0px;
  max-width: 739px;
  border-radius: 4px;
}
.page-conteiner__inserted-image {
  margin-bottom: 31px;
}
.example-content {
  display: flex;
  flex-direction: column;
  padding-top: 31px;
  overflow-y: auto;
}
</style>
